rammp-org/prototype-fw/holo_deck_mib/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The ESP32-P4-ETH kit's chip revision (as the MIB / esp32-p4-eth example)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 16 MB flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Ethernet (on-chip EMAC + the kit's IP101 PHY, via the esp32-p4-eth BSP)
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y

# Memory: the RTPS engine + its worker pool run on the main task's stack budget
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# RTPS endpoint budget: 2 writers + 3 readers here, plus discovery's pair
# (same numbers the HMI uses)
CONFIG_RTPS_LIMIT_NUM_STATELESS_WRITERS=6
CONFIG_RTPS_LIMIT_NUM_STATELESS_READERS=6
CONFIG_RTPS_LIMIT_MAX_NUM_READER_CALLBACKS=6

# 1 kHz tick so the 20 ms control loop and the 50 ms joystick watchdog resolve
CONFIG_FREERTOS_HZ=1000

# Partition table (8 MB app slot on the 16 MB flash)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
